/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1712.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: chshin <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/08/04 10:34:04 by chshin            #+#    #+#             */
/*   Updated: 2020/08/04 11:19:19 by chshin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int		main()
{
	int A = 0;
	int B = 0;
	int C = 0;
	int profit = 0;
	int x = 0; //판매대수

	scanf("%d %d %d", &A, &B, &C);
	profit = C - B;
	if (profit <= 0)
	{
		printf("%d\n", -1);
		return (0);
	}
	x = A / profit + 1;
	printf("%d\n", x); //소수점은 버리고 자연수 부분만 출력
	return (0);
}
